mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/common/s6e2c3xj.h
typedef struct stc_hsspi_txfifo14_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo14_field_t;

typedef struct stc_hsspi_txfifo15_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo15_field_t;

typedef struct stc_hsspi_rxfifo0_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_hsspi_rxfifo0_field_t;

typedef struct stc_hsspi_rxfifo1_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_hsspi_rxfifo1_field_t;

typedef struct stc_hsspi_rxfifo2_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_hsspi_rxfifo2_field_t;

typedef struct stc_hsspi_rxfifo3_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_hsspi_rxfifo3_field_t;

