mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/common/s6e2c3xj.h
/*******************************************************************************
* HSSPI_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t MCTRL;
        stc_hsspi_mctrl_field_t MCTRL_f;
        struct {
          union {
            __IO uint16_t MCTRLL;
            struct {
              __IO uint8_t MCTRLLL;
              __IO uint8_t MCTRLLH;
            };
          };
          union {
            __IO uint16_t MCTRLH;
            struct {
              __IO uint8_t MCTRLHL;
              __IO uint8_t MCTRLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCC0;
        stc_hsspi_pcc0_field_t PCC0_f;
        struct {
          union {
            __IO uint16_t PCC0L;
            struct {
              __IO uint8_t PCC0LL;
              __IO uint8_t PCC0LH;
            };
          };
          union {
            __IO uint16_t PCC0H;
            struct {
              __IO uint8_t PCC0HL;
              __IO uint8_t PCC0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCC1;
        stc_hsspi_pcc1_field_t PCC1_f;
        struct {
          union {
            __IO uint16_t PCC1L;
            struct {
              __IO uint8_t PCC1LL;
              __IO uint8_t PCC1LH;
            };
          };
          union {
            __IO uint16_t PCC1H;
            struct {
              __IO uint8_t PCC1HL;
              __IO uint8_t PCC1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCC2;
        stc_hsspi_pcc2_field_t PCC2_f;
        struct {
          union {
            __IO uint16_t PCC2L;
            struct {
              __IO uint8_t PCC2LL;
              __IO uint8_t PCC2LH;
            };
          };
          union {
            __IO uint16_t PCC2H;
            struct {
              __IO uint8_t PCC2HL;
              __IO uint8_t PCC2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCC3;
        stc_hsspi_pcc3_field_t PCC3_f;
        struct {
          union {
            __IO uint16_t PCC3L;
            struct {
              __IO uint8_t PCC3LL;
              __IO uint8_t PCC3LH;
            };
          };
          union {
            __IO uint16_t PCC3H;
            struct {
              __IO uint8_t PCC3HL;
              __IO uint8_t PCC3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXF;
        stc_hsspi_txf_field_t TXF_f;
        struct {
          union {
            __IO uint16_t TXFL;
            struct {
              __IO uint8_t TXFLL;
              __IO uint8_t TXFLH;
            };
          };
          union {
            __IO uint16_t TXFH;
            struct {
              __IO uint8_t TXFHL;
              __IO uint8_t TXFHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXE;
        stc_hsspi_txe_field_t TXE_f;
        struct {
          union {
            __IO uint16_t TXEL;
            struct {
              __IO uint8_t TXELL;
              __IO uint8_t TXELH;
            };
          };
          union {
            __IO uint16_t TXEH;
            struct {
              __IO uint8_t TXEHL;
              __IO uint8_t TXEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXC;
        stc_hsspi_txc_field_t TXC_f;
        struct {
          union {
            __IO uint16_t TXCL;
            struct {
              __IO uint8_t TXCLL;
              __IO uint8_t TXCLH;
            };
          };
          union {
            __IO uint16_t TXCH;
            struct {
              __IO uint8_t TXCHL;
              __IO uint8_t TXCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXF;
        stc_hsspi_rxf_field_t RXF_f;
        struct {
          union {
            __IO uint16_t RXFL;
            struct {
              __IO uint8_t RXFLL;
              __IO uint8_t RXFLH;
            };
          };
          union {
            __IO uint16_t RXFH;
            struct {
              __IO uint8_t RXFHL;
              __IO uint8_t RXFHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXE;
        stc_hsspi_rxe_field_t RXE_f;
        struct {
          union {
            __IO uint16_t RXEL;
            struct {
              __IO uint8_t RXELL;
              __IO uint8_t RXELH;
            };
          };
          union {
            __IO uint16_t RXEH;
            struct {
              __IO uint8_t RXEHL;
              __IO uint8_t RXEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXC;
        stc_hsspi_rxc_field_t RXC_f;
        struct {
          union {
            __IO uint16_t RXCL;
            struct {
              __IO uint8_t RXCLL;
              __IO uint8_t RXCLH;
            };
          };
          union {
            __IO uint16_t RXCH;
            struct {
              __IO uint8_t RXCHL;
              __IO uint8_t RXCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FAULTF;
        stc_hsspi_faultf_field_t FAULTF_f;
        struct {
          union {
            __IO uint16_t FAULTFL;
            struct {
              __IO uint8_t FAULTFLL;
              __IO uint8_t FAULTFLH;
            };
          };
          union {
            __IO uint16_t FAULTFH;
            struct {
              __IO uint8_t FAULTFHL;
              __IO uint8_t FAULTFHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FAULTC;
        stc_hsspi_faultc_field_t FAULTC_f;
        struct {
          union {
            __IO uint16_t FAULTCL;
            struct {
              __IO uint8_t FAULTCLL;
              __IO uint8_t FAULTCLH;
            };
          };
          union {
            __IO uint16_t FAULTCH;
            struct {
              __IO uint8_t FAULTCHL;
              __IO uint8_t FAULTCHH;
            };
          };
        };
    };
    union {
        __IO  uint8_t DMCFG;
        stc_hsspi_dmcfg_field_t DMCFG_f;
    };
    union {
        __IO  uint8_t DMDMAEN;
        stc_hsspi_dmdmaen_field_t DMDMAEN_f;
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO  uint8_t DMSTART;
        stc_hsspi_dmstart_field_t DMSTART_f;
    };
    union {
        __IO  uint8_t DMSTOP;
        stc_hsspi_dmstop_field_t DMSTOP_f;
    };
    union {
        __IO  uint8_t DMPSEL;
        stc_hsspi_dmpsel_field_t DMPSEL_f;
    };
    union {
        __IO  uint8_t DMTRP;
        stc_hsspi_dmtrp_field_t DMTRP_f;
    };
    union {
        __IO uint16_t DMBCC;
        stc_hsspi_dmbcc_field_t DMBCC_f;
        struct {
            __IO  uint8_t DMBCCL;
            __IO  uint8_t DMBCCH;
        };
    };
    union {
        __IO uint16_t DMBCS;
        stc_hsspi_dmbcs_field_t DMBCS_f;
        struct {
            __IO  uint8_t DMBCSL;
            __IO  uint8_t DMBCSH;
        };
    };
    union {
        __IO uint32_t DMSTATUS;
        stc_hsspi_dmstatus_field_t DMSTATUS_f;
        struct {
          union {
            __IO uint16_t DMSTATUSL;
            struct {
              __IO uint8_t DMSTATUSLL;
              __IO uint8_t DMSTATUSLH;
            };
          };
          union {
            __IO uint16_t DMSTATUSH;
            struct {
              __IO uint8_t DMSTATUSHL;
              __IO uint8_t DMSTATUSHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[8];
    union {
        __IO uint32_t FIFOCFG;
        stc_hsspi_fifocfg_field_t FIFOCFG_f;
        struct {
          union {
            __IO uint16_t FIFOCFGL;
            struct {
              __IO uint8_t FIFOCFGLL;
              __IO uint8_t FIFOCFGLH;
            };
          };
          union {
            __IO uint16_t FIFOCFGH;
            struct {
              __IO uint8_t FIFOCFGHL;
              __IO uint8_t FIFOCFGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO0;
        stc_hsspi_txfifo0_field_t TXFIFO0_f;
        struct {
          union {
            __IO uint16_t TXFIFO0L;
            struct {
              __IO uint8_t TXFIFO0LL;
              __IO uint8_t TXFIFO0LH;
            };
          };
          union {
            __IO uint16_t TXFIFO0H;
            struct {
              __IO uint8_t TXFIFO0HL;
              __IO uint8_t TXFIFO0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO1;
        stc_hsspi_txfifo1_field_t TXFIFO1_f;
        struct {
          union {
            __IO uint16_t TXFIFO1L;
            struct {
              __IO uint8_t TXFIFO1LL;
              __IO uint8_t TXFIFO1LH;
            };
          };
          union {
            __IO uint16_t TXFIFO1H;
            struct {
              __IO uint8_t TXFIFO1HL;
              __IO uint8_t TXFIFO1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO2;
        stc_hsspi_txfifo2_field_t TXFIFO2_f;
        struct {
          union {
            __IO uint16_t TXFIFO2L;
            struct {
              __IO uint8_t TXFIFO2LL;
              __IO uint8_t TXFIFO2LH;
            };
          };
          union {
            __IO uint16_t TXFIFO2H;
            struct {
              __IO uint8_t TXFIFO2HL;
              __IO uint8_t TXFIFO2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO3;
        stc_hsspi_txfifo3_field_t TXFIFO3_f;
        struct {
          union {
            __IO uint16_t TXFIFO3L;
            struct {
              __IO uint8_t TXFIFO3LL;
              __IO uint8_t TXFIFO3LH;
            };
          };
          union {
            __IO uint16_t TXFIFO3H;
            struct {
              __IO uint8_t TXFIFO3HL;
              __IO uint8_t TXFIFO3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO4;
        stc_hsspi_txfifo4_field_t TXFIFO4_f;
        struct {
          union {
            __IO uint16_t TXFIFO4L;
            struct {
              __IO uint8_t TXFIFO4LL;
              __IO uint8_t TXFIFO4LH;
            };
          };
          union {
            __IO uint16_t TXFIFO4H;
            struct {
              __IO uint8_t TXFIFO4HL;
              __IO uint8_t TXFIFO4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO5;
        stc_hsspi_txfifo5_field_t TXFIFO5_f;
        struct {
          union {
            __IO uint16_t TXFIFO5L;
            struct {
              __IO uint8_t TXFIFO5LL;
              __IO uint8_t TXFIFO5LH;
            };
          };
          union {
            __IO uint16_t TXFIFO5H;
            struct {
              __IO uint8_t TXFIFO5HL;
              __IO uint8_t TXFIFO5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO6;
        stc_hsspi_txfifo6_field_t TXFIFO6_f;
        struct {
          union {
            __IO uint16_t TXFIFO6L;
            struct {
              __IO uint8_t TXFIFO6LL;
              __IO uint8_t TXFIFO6LH;
            };
          };
          union {
            __IO uint16_t TXFIFO6H;
            struct {
              __IO uint8_t TXFIFO6HL;
              __IO uint8_t TXFIFO6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO7;
        stc_hsspi_txfifo7_field_t TXFIFO7_f;
        struct {
          union {
            __IO uint16_t TXFIFO7L;
            struct {
              __IO uint8_t TXFIFO7LL;
              __IO uint8_t TXFIFO7LH;
            };
          };
          union {
            __IO uint16_t TXFIFO7H;
            struct {
              __IO uint8_t TXFIFO7HL;
              __IO uint8_t TXFIFO7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO8;
        stc_hsspi_txfifo8_field_t TXFIFO8_f;
        struct {
          union {
            __IO uint16_t TXFIFO8L;
            struct {
              __IO uint8_t TXFIFO8LL;
              __IO uint8_t TXFIFO8LH;
            };
          };
          union {
            __IO uint16_t TXFIFO8H;
            struct {
              __IO uint8_t TXFIFO8HL;
              __IO uint8_t TXFIFO8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO9;
        stc_hsspi_txfifo9_field_t TXFIFO9_f;
        struct {
          union {
            __IO uint16_t TXFIFO9L;
            struct {
              __IO uint8_t TXFIFO9LL;
              __IO uint8_t TXFIFO9LH;
            };
          };
          union {
            __IO uint16_t TXFIFO9H;
            struct {
              __IO uint8_t TXFIFO9HL;
              __IO uint8_t TXFIFO9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO10;
        stc_hsspi_txfifo10_field_t TXFIFO10_f;
        struct {
          union {
            __IO uint16_t TXFIFO10L;
            struct {
              __IO uint8_t TXFIFO10LL;
              __IO uint8_t TXFIFO10LH;
            };
          };
          union {
            __IO uint16_t TXFIFO10H;
            struct {
              __IO uint8_t TXFIFO10HL;
              __IO uint8_t TXFIFO10HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO11;
        stc_hsspi_txfifo11_field_t TXFIFO11_f;
        struct {
          union {
            __IO uint16_t TXFIFO11L;
            struct {
              __IO uint8_t TXFIFO11LL;
              __IO uint8_t TXFIFO11LH;
            };
          };
          union {
            __IO uint16_t TXFIFO11H;
            struct {
              __IO uint8_t TXFIFO11HL;
              __IO uint8_t TXFIFO11HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO12;
        stc_hsspi_txfifo12_field_t TXFIFO12_f;
        struct {
          union {
            __IO uint16_t TXFIFO12L;
            struct {
              __IO uint8_t TXFIFO12LL;
              __IO uint8_t TXFIFO12LH;
            };
          };
          union {
            __IO uint16_t TXFIFO12H;
            struct {
              __IO uint8_t TXFIFO12HL;
              __IO uint8_t TXFIFO12HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO13;
        stc_hsspi_txfifo13_field_t TXFIFO13_f;
        struct {
          union {
            __IO uint16_t TXFIFO13L;
            struct {
              __IO uint8_t TXFIFO13LL;
              __IO uint8_t TXFIFO13LH;
            };
          };
          union {
            __IO uint16_t TXFIFO13H;
            struct {
              __IO uint8_t TXFIFO13HL;
              __IO uint8_t TXFIFO13HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO14;
        stc_hsspi_txfifo14_field_t TXFIFO14_f;
        struct {
          union {
            __IO uint16_t TXFIFO14L;
            struct {
              __IO uint8_t TXFIFO14LL;
              __IO uint8_t TXFIFO14LH;
            };
          };
          union {
            __IO uint16_t TXFIFO14H;
            struct {
              __IO uint8_t TXFIFO14HL;
              __IO uint8_t TXFIFO14HH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFIFO15;
        stc_hsspi_txfifo15_field_t TXFIFO15_f;
        struct {
          union {
            __IO uint16_t TXFIFO15L;
            struct {
              __IO uint8_t TXFIFO15LL;
              __IO uint8_t TXFIFO15LH;
            };
          };
          union {
            __IO uint16_t TXFIFO15H;
            struct {
              __IO uint8_t TXFIFO15HL;
              __IO uint8_t TXFIFO15HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO0;
        stc_hsspi_rxfifo0_field_t RXFIFO0_f;
        struct {
          union {
            __IO uint16_t RXFIFO0L;
            struct {
              __IO uint8_t RXFIFO0LL;
              __IO uint8_t RXFIFO0LH;
            };
          };
          union {
            __IO uint16_t RXFIFO0H;
            struct {
              __IO uint8_t RXFIFO0HL;
              __IO uint8_t RXFIFO0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO1;
        stc_hsspi_rxfifo1_field_t RXFIFO1_f;
        struct {
          union {
            __IO uint16_t RXFIFO1L;
            struct {
              __IO uint8_t RXFIFO1LL;
              __IO uint8_t RXFIFO1LH;
            };
          };
          union {
            __IO uint16_t RXFIFO1H;
            struct {
              __IO uint8_t RXFIFO1HL;
              __IO uint8_t RXFIFO1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO2;
        stc_hsspi_rxfifo2_field_t RXFIFO2_f;
        struct {
          union {
            __IO uint16_t RXFIFO2L;
            struct {
              __IO uint8_t RXFIFO2LL;
              __IO uint8_t RXFIFO2LH;
            };
          };
          union {
            __IO uint16_t RXFIFO2H;
            struct {
              __IO uint8_t RXFIFO2HL;
              __IO uint8_t RXFIFO2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO3;
        stc_hsspi_rxfifo3_field_t RXFIFO3_f;
        struct {
          union {
            __IO uint16_t RXFIFO3L;
            struct {
              __IO uint8_t RXFIFO3LL;
              __IO uint8_t RXFIFO3LH;
            };
          };
          union {
            __IO uint16_t RXFIFO3H;
            struct {
              __IO uint8_t RXFIFO3HL;
              __IO uint8_t RXFIFO3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO4;
        stc_hsspi_rxfifo4_field_t RXFIFO4_f;
        struct {
          union {
            __IO uint16_t RXFIFO4L;
            struct {
              __IO uint8_t RXFIFO4LL;
              __IO uint8_t RXFIFO4LH;
            };
          };
          union {
            __IO uint16_t RXFIFO4H;
            struct {
              __IO uint8_t RXFIFO4HL;
              __IO uint8_t RXFIFO4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO5;
        stc_hsspi_rxfifo5_field_t RXFIFO5_f;
        struct {
          union {
            __IO uint16_t RXFIFO5L;
            struct {
              __IO uint8_t RXFIFO5LL;
              __IO uint8_t RXFIFO5LH;
            };
          };
          union {
            __IO uint16_t RXFIFO5H;
            struct {
              __IO uint8_t RXFIFO5HL;
              __IO uint8_t RXFIFO5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO6;
        stc_hsspi_rxfifo6_field_t RXFIFO6_f;
        struct {
          union {
            __IO uint16_t RXFIFO6L;
            struct {
              __IO uint8_t RXFIFO6LL;
              __IO uint8_t RXFIFO6LH;
            };
          };
          union {
            __IO uint16_t RXFIFO6H;
            struct {
              __IO uint8_t RXFIFO6HL;
              __IO uint8_t RXFIFO6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO7;
        stc_hsspi_rxfifo7_field_t RXFIFO7_f;
        struct {
          union {
            __IO uint16_t RXFIFO7L;
            struct {
              __IO uint8_t RXFIFO7LL;
              __IO uint8_t RXFIFO7LH;
            };
          };
          union {
            __IO uint16_t RXFIFO7H;
            struct {
              __IO uint8_t RXFIFO7HL;
              __IO uint8_t RXFIFO7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO8;
        stc_hsspi_rxfifo8_field_t RXFIFO8_f;
        struct {
          union {
            __IO uint16_t RXFIFO8L;
            struct {
              __IO uint8_t RXFIFO8LL;
              __IO uint8_t RXFIFO8LH;
            };
          };
          union {
            __IO uint16_t RXFIFO8H;
            struct {
              __IO uint8_t RXFIFO8HL;
              __IO uint8_t RXFIFO8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO9;
        stc_hsspi_rxfifo9_field_t RXFIFO9_f;
        struct {
          union {
            __IO uint16_t RXFIFO9L;
            struct {
              __IO uint8_t RXFIFO9LL;
              __IO uint8_t RXFIFO9LH;
            };
          };
          union {
            __IO uint16_t RXFIFO9H;
            struct {
              __IO uint8_t RXFIFO9HL;
              __IO uint8_t RXFIFO9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO10;
        stc_hsspi_rxfifo10_field_t RXFIFO10_f;
        struct {
          union {
            __IO uint16_t RXFIFO10L;
            struct {
              __IO uint8_t RXFIFO10LL;
              __IO uint8_t RXFIFO10LH;
            };
          };
          union {
            __IO uint16_t RXFIFO10H;
            struct {
              __IO uint8_t RXFIFO10HL;
              __IO uint8_t RXFIFO10HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO11;
        stc_hsspi_rxfifo11_field_t RXFIFO11_f;
        struct {
          union {
            __IO uint16_t RXFIFO11L;
            struct {
              __IO uint8_t RXFIFO11LL;
              __IO uint8_t RXFIFO11LH;
            };
          };
          union {
            __IO uint16_t RXFIFO11H;
            struct {
              __IO uint8_t RXFIFO11HL;
              __IO uint8_t RXFIFO11HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO12;
        stc_hsspi_rxfifo12_field_t RXFIFO12_f;
        struct {
          union {
            __IO uint16_t RXFIFO12L;
            struct {
              __IO uint8_t RXFIFO12LL;
              __IO uint8_t RXFIFO12LH;
            };
          };
          union {
            __IO uint16_t RXFIFO12H;
            struct {
              __IO uint8_t RXFIFO12HL;
              __IO uint8_t RXFIFO12HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO13;
        stc_hsspi_rxfifo13_field_t RXFIFO13_f;
        struct {
          union {
            __IO uint16_t RXFIFO13L;
            struct {
              __IO uint8_t RXFIFO13LL;
              __IO uint8_t RXFIFO13LH;
            };
          };
          union {
            __IO uint16_t RXFIFO13H;
            struct {
              __IO uint8_t RXFIFO13HL;
              __IO uint8_t RXFIFO13HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFO14;
        stc_hsspi_rxfifo14_field_t RXFIFO14_f;
        struct {
          union {
            __IO uint16_t RXFIFO14L;
            struct {
              __IO uint8_t RXFIFO14LL;
              __IO uint8_t RXFIFO14LH;
            };
          };
          union {
            __IO uint16_t RXFIFO14H;
            struct {
              __IO uint8_t RXFIFO14HL;
