mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/common/s6e2c3xj.h
/*******************************************************************************
* MFS Registers MFS11
*   Register Definition
*******************************************************************************/
#define FM_MFS11_CSIO_SMR                         *((volatile  uint8_t*)(0x40038B00UL))
#define FM4_MFS11_CSIO_SMR                        *((volatile  uint8_t*)(0x40038B00UL))
#define FM_MFS11_I2C_SMR                          *((volatile  uint8_t*)(0x40038B00UL))
#define FM4_MFS11_I2C_SMR                         *((volatile  uint8_t*)(0x40038B00UL))
#define FM_MFS11_LIN_SMR                          *((volatile  uint8_t*)(0x40038B00UL))
#define FM4_MFS11_LIN_SMR                         *((volatile  uint8_t*)(0x40038B00UL))
#define FM_MFS11_UART_SMR                         *((volatile  uint8_t*)(0x40038B00UL))
#define FM4_MFS11_UART_SMR                        *((volatile  uint8_t*)(0x40038B00UL))
#define FM_MFS11_CSIO_SCR                         *((volatile  uint8_t*)(0x40038B01UL))
#define FM4_MFS11_CSIO_SCR                        *((volatile  uint8_t*)(0x40038B01UL))
#define FM_MFS11_I2C_IBCR                         *((volatile  uint8_t*)(0x40038B01UL))
#define FM4_MFS11_I2C_IBCR                        *((volatile  uint8_t*)(0x40038B01UL))
#define FM_MFS11_LIN_SCR                          *((volatile  uint8_t*)(0x40038B01UL))
#define FM4_MFS11_LIN_SCR                         *((volatile  uint8_t*)(0x40038B01UL))
#define FM_MFS11_UART_SCR                         *((volatile  uint8_t*)(0x40038B01UL))
#define FM4_MFS11_UART_SCR                        *((volatile  uint8_t*)(0x40038B01UL))
#define FM_MFS11_CSIO_ESCR                        *((volatile  uint8_t*)(0x40038B04UL))
#define FM4_MFS11_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038B04UL))
#define FM_MFS11_I2C_IBSR                         *((volatile  uint8_t*)(0x40038B04UL))
#define FM4_MFS11_I2C_IBSR                        *((volatile  uint8_t*)(0x40038B04UL))
#define FM_MFS11_LIN_ESCR                         *((volatile  uint8_t*)(0x40038B04UL))
#define FM4_MFS11_LIN_ESCR                        *((volatile  uint8_t*)(0x40038B04UL))
#define FM_MFS11_UART_ESCR                        *((volatile  uint8_t*)(0x40038B04UL))
#define FM4_MFS11_UART_ESCR                       *((volatile  uint8_t*)(0x40038B04UL))
#define FM_MFS11_CSIO_SSR                         *((volatile  uint8_t*)(0x40038B05UL))
#define FM4_MFS11_CSIO_SSR                        *((volatile  uint8_t*)(0x40038B05UL))
#define FM_MFS11_I2C_SSR                          *((volatile  uint8_t*)(0x40038B05UL))
#define FM4_MFS11_I2C_SSR                         *((volatile  uint8_t*)(0x40038B05UL))
#define FM_MFS11_LIN_SSR                          *((volatile  uint8_t*)(0x40038B05UL))
#define FM4_MFS11_LIN_SSR                         *((volatile  uint8_t*)(0x40038B05UL))
#define FM_MFS11_UART_SSR                         *((volatile  uint8_t*)(0x40038B05UL))
#define FM4_MFS11_UART_SSR                        *((volatile  uint8_t*)(0x40038B05UL))
#define FM_MFS11_CSIO_RDR                         *((volatile uint16_t*)(0x40038B08UL))
#define FM4_MFS11_CSIO_RDR                        *((volatile uint16_t*)(0x40038B08UL))
#define FM_MFS11_CSIO_TDR                         *((volatile uint16_t*)(0x40038B08UL))
#define FM4_MFS11_CSIO_TDR                        *((volatile uint16_t*)(0x40038B08UL))
#define FM_MFS11_I2C_RDR                          *((volatile uint16_t*)(0x40038B08UL))
#define FM4_MFS11_I2C_RDR                         *((volatile uint16_t*)(0x40038B08UL))
#define FM_MFS11_I2C_TDR                          *((volatile uint16_t*)(0x40038B08UL))
#define FM4_MFS11_I2C_TDR                         *((volatile uint16_t*)(0x40038B08UL))
#define FM_MFS11_LIN_RDR                          *((volatile uint16_t*)(0x40038B08UL))
#define FM4_MFS11_LIN_RDR                         *((volatile uint16_t*)(0x40038B08UL))
#define FM_MFS11_LIN_TDR                          *((volatile uint16_t*)(0x40038B08UL))
#define FM4_MFS11_LIN_TDR                         *((volatile uint16_t*)(0x40038B08UL))
#define FM_MFS11_UART_RDR                         *((volatile uint16_t*)(0x40038B08UL))
#define FM4_MFS11_UART_RDR                        *((volatile uint16_t*)(0x40038B08UL))
#define FM_MFS11_UART_TDR                         *((volatile uint16_t*)(0x40038B08UL))
#define FM4_MFS11_UART_TDR                        *((volatile uint16_t*)(0x40038B08UL))
#define FM_MFS11_CSIO_BGR                         *((volatile uint16_t*)(0x40038B0CUL))
#define FM4_MFS11_CSIO_BGR                        *((volatile uint16_t*)(0x40038B0CUL))
#define FM_MFS11_I2C_BGR                          *((volatile uint16_t*)(0x40038B0CUL))
#define FM4_MFS11_I2C_BGR                         *((volatile uint16_t*)(0x40038B0CUL))
#define FM_MFS11_LIN_BGR                          *((volatile uint16_t*)(0x40038B0CUL))
#define FM4_MFS11_LIN_BGR                         *((volatile uint16_t*)(0x40038B0CUL))
#define FM_MFS11_UART_BGR                         *((volatile uint16_t*)(0x40038B0CUL))
#define FM4_MFS11_UART_BGR                        *((volatile uint16_t*)(0x40038B0CUL))
#define FM_MFS11_I2C_ISBA                         *((volatile  uint8_t*)(0x40038B10UL))
#define FM4_MFS11_I2C_ISBA                        *((volatile  uint8_t*)(0x40038B10UL))
#define FM_MFS11_I2C_ISMK                         *((volatile  uint8_t*)(0x40038B11UL))
#define FM4_MFS11_I2C_ISMK                        *((volatile  uint8_t*)(0x40038B11UL))
#define FM_MFS11_CSIO_FCR                         *((volatile uint16_t*)(0x40038B14UL))
#define FM4_MFS11_CSIO_FCR                        *((volatile uint16_t*)(0x40038B14UL))
#define FM_MFS11_I2C_FCR                          *((volatile uint16_t*)(0x40038B14UL))
#define FM4_MFS11_I2C_FCR                         *((volatile uint16_t*)(0x40038B14UL))
#define FM_MFS11_LIN_FCR                          *((volatile uint16_t*)(0x40038B14UL))
#define FM4_MFS11_LIN_FCR                         *((volatile uint16_t*)(0x40038B14UL))
#define FM_MFS11_UART_FCR                         *((volatile uint16_t*)(0x40038B14UL))
#define FM4_MFS11_UART_FCR                        *((volatile uint16_t*)(0x40038B14UL))
#define FM_MFS11_CSIO_FBYTE1                      *((volatile  uint8_t*)(0x40038B18UL))
#define FM4_MFS11_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038B18UL))
#define FM_MFS11_I2C_FBYTE1                       *((volatile  uint8_t*)(0x40038B18UL))
#define FM4_MFS11_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038B18UL))
#define FM_MFS11_LIN_FBYTE1                       *((volatile  uint8_t*)(0x40038B18UL))
#define FM4_MFS11_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038B18UL))
#define FM_MFS11_UART_FBYTE1                      *((volatile  uint8_t*)(0x40038B18UL))
#define FM4_MFS11_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038B18UL))
#define FM_MFS11_CSIO_FBYTE2                      *((volatile  uint8_t*)(0x40038B19UL))
#define FM4_MFS11_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038B19UL))
#define FM_MFS11_I2C_FBYTE2                       *((volatile  uint8_t*)(0x40038B19UL))
#define FM4_MFS11_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038B19UL))
#define FM_MFS11_LIN_FBYTE2                       *((volatile  uint8_t*)(0x40038B19UL))
#define FM4_MFS11_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038B19UL))
#define FM_MFS11_UART_FBYTE2                      *((volatile  uint8_t*)(0x40038B19UL))
#define FM4_MFS11_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038B19UL))
#define FM_MFS11_CSIO_SCSTR0                      *((volatile  uint8_t*)(0x40038B1CUL))
#define FM4_MFS11_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x40038B1CUL))
#define FM_MFS11_I2C_NFCR                         *((volatile  uint8_t*)(0x40038B1CUL))
#define FM4_MFS11_I2C_NFCR                        *((volatile  uint8_t*)(0x40038B1CUL))
#define FM_MFS11_CSIO_SCSTR1                      *((volatile  uint8_t*)(0x40038B1DUL))
#define FM4_MFS11_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x40038B1DUL))
#define FM_MFS11_I2C_EIBCR                        *((volatile  uint8_t*)(0x40038B1DUL))
#define FM4_MFS11_I2C_EIBCR                       *((volatile  uint8_t*)(0x40038B1DUL))
#define FM_MFS11_CSIO_SCSTR32                     *((volatile uint16_t*)(0x40038B20UL))
#define FM4_MFS11_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038B20UL))
#define FM_MFS11_CSIO_SACSR                       *((volatile uint16_t*)(0x40038B24UL))
#define FM4_MFS11_CSIO_SACSR                      *((volatile uint16_t*)(0x40038B24UL))
#define FM_MFS11_CSIO_STMR                        *((volatile uint16_t*)(0x40038B28UL))
#define FM4_MFS11_CSIO_STMR                       *((volatile uint16_t*)(0x40038B28UL))
#define FM_MFS11_CSIO_STMCR                       *((volatile uint16_t*)(0x40038B2CUL))
#define FM4_MFS11_CSIO_STMCR                      *((volatile uint16_t*)(0x40038B2CUL))
#define FM_MFS11_CSIO_SCSCR                       *((volatile uint16_t*)(0x40038B30UL))
#define FM4_MFS11_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038B30UL))
#define FM_MFS11_CSIO_SCSFR0                      *((volatile  uint8_t*)(0x40038B34UL))
#define FM4_MFS11_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038B34UL))
#define FM_MFS11_CSIO_SCSFR1                      *((volatile  uint8_t*)(0x40038B35UL))
#define FM4_MFS11_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038B35UL))
#define FM_MFS11_CSIO_SCSFR2                      *((volatile  uint8_t*)(0x40038B38UL))
#define FM4_MFS11_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038B38UL))
#define FM_MFS11_CSIO_TBYTE0                      *((volatile  uint8_t*)(0x40038B3CUL))
#define FM4_MFS11_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x40038B3CUL))
#define FM_MFS11_CSIO_TBYTE1                      *((volatile  uint8_t*)(0x40038B3DUL))
#define FM4_MFS11_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x40038B3DUL))
#define FM_MFS11_CSIO_TBYTE2                      *((volatile  uint8_t*)(0x40038B40UL))
#define FM4_MFS11_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038B40UL))
#define FM_MFS11_CSIO_TBYTE3                      *((volatile  uint8_t*)(0x40038B41UL))
#define FM4_MFS11_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038B41UL))

