mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/common/s6e2c3xj.h
#define bFM_GPIO_PCR5_P0                          *((volatile  uint8_t *)(0x42DE2280UL))
#define bFM4_GPIO_PCR5_P0                         *((volatile  uint8_t *)(0x42DE2280UL))
#define bFM_GPIO_PCR5_P1                          *((volatile  uint8_t *)(0x42DE2284UL))
#define bFM4_GPIO_PCR5_P1                         *((volatile  uint8_t *)(0x42DE2284UL))
#define bFM_GPIO_PCR5_P2                          *((volatile  uint8_t *)(0x42DE2288UL))
#define bFM4_GPIO_PCR5_P2                         *((volatile  uint8_t *)(0x42DE2288UL))
#define bFM_GPIO_PCR5_PD                          *((volatile  uint8_t *)(0x42DE22B4UL))
#define bFM4_GPIO_PCR5_PD                         *((volatile  uint8_t *)(0x42DE22B4UL))
#define bFM_GPIO_PCR5_PE                          *((volatile  uint8_t *)(0x42DE22B8UL))
#define bFM4_GPIO_PCR5_PE                         *((volatile  uint8_t *)(0x42DE22B8UL))
#define bFM_GPIO_PCR5_PF                          *((volatile  uint8_t *)(0x42DE22BCUL))
#define bFM4_GPIO_PCR5_PF                         *((volatile  uint8_t *)(0x42DE22BCUL))

#define bFM_GPIO_PCR6_P0                          *((volatile  uint8_t *)(0x42DE2300UL))
#define bFM4_GPIO_PCR6_P0                         *((volatile  uint8_t *)(0x42DE2300UL))
#define bFM_GPIO_PCR6_P1                          *((volatile  uint8_t *)(0x42DE2304UL))
#define bFM4_GPIO_PCR6_P1                         *((volatile  uint8_t *)(0x42DE2304UL))
#define bFM_GPIO_PCR6_P2                          *((volatile  uint8_t *)(0x42DE2308UL))
#define bFM4_GPIO_PCR6_P2                         *((volatile  uint8_t *)(0x42DE2308UL))
#define bFM_GPIO_PCR6_P3                          *((volatile  uint8_t *)(0x42DE230CUL))
#define bFM4_GPIO_PCR6_P3                         *((volatile  uint8_t *)(0x42DE230CUL))
#define bFM_GPIO_PCR6_P4                          *((volatile  uint8_t *)(0x42DE2310UL))
#define bFM4_GPIO_PCR6_P4                         *((volatile  uint8_t *)(0x42DE2310UL))
#define bFM_GPIO_PCR6_P5                          *((volatile  uint8_t *)(0x42DE2314UL))
#define bFM4_GPIO_PCR6_P5                         *((volatile  uint8_t *)(0x42DE2314UL))
#define bFM_GPIO_PCR6_PE                          *((volatile  uint8_t *)(0x42DE2338UL))
#define bFM4_GPIO_PCR6_PE                         *((volatile  uint8_t *)(0x42DE2338UL))

#define bFM_GPIO_PCR7_P0                          *((volatile  uint8_t *)(0x42DE2380UL))
#define bFM4_GPIO_PCR7_P0                         *((volatile  uint8_t *)(0x42DE2380UL))
#define bFM_GPIO_PCR7_P1                          *((volatile  uint8_t *)(0x42DE2384UL))
#define bFM4_GPIO_PCR7_P1                         *((volatile  uint8_t *)(0x42DE2384UL))
#define bFM_GPIO_PCR7_P2                          *((volatile  uint8_t *)(0x42DE2388UL))
#define bFM4_GPIO_PCR7_P2                         *((volatile  uint8_t *)(0x42DE2388UL))
#define bFM_GPIO_PCR7_P3                          *((volatile  uint8_t *)(0x42DE238CUL))
#define bFM4_GPIO_PCR7_P3                         *((volatile  uint8_t *)(0x42DE238CUL))
#define bFM_GPIO_PCR7_P4                          *((volatile  uint8_t *)(0x42DE2390UL))
#define bFM4_GPIO_PCR7_P4                         *((volatile  uint8_t *)(0x42DE2390UL))
#define bFM_GPIO_PCR7_P5                          *((volatile  uint8_t *)(0x42DE2394UL))
#define bFM4_GPIO_PCR7_P5                         *((volatile  uint8_t *)(0x42DE2394UL))
#define bFM_GPIO_PCR7_P6                          *((volatile  uint8_t *)(0x42DE2398UL))
#define bFM4_GPIO_PCR7_P6                         *((volatile  uint8_t *)(0x42DE2398UL))
#define bFM_GPIO_PCR7_P7                          *((volatile  uint8_t *)(0x42DE239CUL))
#define bFM4_GPIO_PCR7_P7                         *((volatile  uint8_t *)(0x42DE239CUL))
#define bFM_GPIO_PCR7_P8                          *((volatile  uint8_t *)(0x42DE23A0UL))
#define bFM4_GPIO_PCR7_P8                         *((volatile  uint8_t *)(0x42DE23A0UL))
#define bFM_GPIO_PCR7_P9                          *((volatile  uint8_t *)(0x42DE23A4UL))
#define bFM4_GPIO_PCR7_P9                         *((volatile  uint8_t *)(0x42DE23A4UL))
#define bFM_GPIO_PCR7_PA                          *((volatile  uint8_t *)(0x42DE23A8UL))
#define bFM4_GPIO_PCR7_PA                         *((volatile  uint8_t *)(0x42DE23A8UL))
#define bFM_GPIO_PCR7_PB                          *((volatile  uint8_t *)(0x42DE23ACUL))
#define bFM4_GPIO_PCR7_PB                         *((volatile  uint8_t *)(0x42DE23ACUL))
#define bFM_GPIO_PCR7_PC                          *((volatile  uint8_t *)(0x42DE23B0UL))
#define bFM4_GPIO_PCR7_PC                         *((volatile  uint8_t *)(0x42DE23B0UL))
#define bFM_GPIO_PCR7_PD                          *((volatile  uint8_t *)(0x42DE23B4UL))
#define bFM4_GPIO_PCR7_PD                         *((volatile  uint8_t *)(0x42DE23B4UL))
#define bFM_GPIO_PCR7_PE                          *((volatile  uint8_t *)(0x42DE23B8UL))
#define bFM4_GPIO_PCR7_PE                         *((volatile  uint8_t *)(0x42DE23B8UL))

#define bFM_GPIO_PCR9_P0                          *((volatile  uint8_t *)(0x42DE2480UL))
#define bFM4_GPIO_PCR9_P0                         *((volatile  uint8_t *)(0x42DE2480UL))
#define bFM_GPIO_PCR9_P1                          *((volatile  uint8_t *)(0x42DE2484UL))
#define bFM4_GPIO_PCR9_P1                         *((volatile  uint8_t *)(0x42DE2484UL))
#define bFM_GPIO_PCR9_P2                          *((volatile  uint8_t *)(0x42DE2488UL))
#define bFM4_GPIO_PCR9_P2                         *((volatile  uint8_t *)(0x42DE2488UL))
#define bFM_GPIO_PCR9_P3                          *((volatile  uint8_t *)(0x42DE248CUL))
#define bFM4_GPIO_PCR9_P3                         *((volatile  uint8_t *)(0x42DE248CUL))
#define bFM_GPIO_PCR9_P4                          *((volatile  uint8_t *)(0x42DE2490UL))
#define bFM4_GPIO_PCR9_P4                         *((volatile  uint8_t *)(0x42DE2490UL))
#define bFM_GPIO_PCR9_P5                          *((volatile  uint8_t *)(0x42DE2494UL))
#define bFM4_GPIO_PCR9_P5                         *((volatile  uint8_t *)(0x42DE2494UL))

#define bFM_GPIO_PCRA_P0                          *((volatile  uint8_t *)(0x42DE2500UL))
#define bFM4_GPIO_PCRA_P0                         *((volatile  uint8_t *)(0x42DE2500UL))
#define bFM_GPIO_PCRA_P1                          *((volatile  uint8_t *)(0x42DE2504UL))
#define bFM4_GPIO_PCRA_P1                         *((volatile  uint8_t *)(0x42DE2504UL))
#define bFM_GPIO_PCRA_P2                          *((volatile  uint8_t *)(0x42DE2508UL))
#define bFM4_GPIO_PCRA_P2                         *((volatile  uint8_t *)(0x42DE2508UL))
#define bFM_GPIO_PCRA_P3                          *((volatile  uint8_t *)(0x42DE250CUL))
#define bFM4_GPIO_PCRA_P3                         *((volatile  uint8_t *)(0x42DE250CUL))
#define bFM_GPIO_PCRA_P4                          *((volatile  uint8_t *)(0x42DE2510UL))
#define bFM4_GPIO_PCRA_P4                         *((volatile  uint8_t *)(0x42DE2510UL))
#define bFM_GPIO_PCRA_P5                          *((volatile  uint8_t *)(0x42DE2514UL))
#define bFM4_GPIO_PCRA_P5                         *((volatile  uint8_t *)(0x42DE2514UL))
#define bFM_GPIO_PCRA_P6                          *((volatile  uint8_t *)(0x42DE2518UL))
#define bFM4_GPIO_PCRA_P6                         *((volatile  uint8_t *)(0x42DE2518UL))
#define bFM_GPIO_PCRA_P7                          *((volatile  uint8_t *)(0x42DE251CUL))
#define bFM4_GPIO_PCRA_P7                         *((volatile  uint8_t *)(0x42DE251CUL))
#define bFM_GPIO_PCRA_P8                          *((volatile  uint8_t *)(0x42DE2520UL))
#define bFM4_GPIO_PCRA_P8                         *((volatile  uint8_t *)(0x42DE2520UL))
#define bFM_GPIO_PCRA_P9                          *((volatile  uint8_t *)(0x42DE2524UL))
#define bFM4_GPIO_PCRA_P9                         *((volatile  uint8_t *)(0x42DE2524UL))
#define bFM_GPIO_PCRA_PA                          *((volatile  uint8_t *)(0x42DE2528UL))
#define bFM4_GPIO_PCRA_PA                         *((volatile  uint8_t *)(0x42DE2528UL))
#define bFM_GPIO_PCRA_PB                          *((volatile  uint8_t *)(0x42DE252CUL))
#define bFM4_GPIO_PCRA_PB                         *((volatile  uint8_t *)(0x42DE252CUL))
#define bFM_GPIO_PCRA_PC                          *((volatile  uint8_t *)(0x42DE2530UL))
#define bFM4_GPIO_PCRA_PC                         *((volatile  uint8_t *)(0x42DE2530UL))
#define bFM_GPIO_PCRA_PD                          *((volatile  uint8_t *)(0x42DE2534UL))
#define bFM4_GPIO_PCRA_PD                         *((volatile  uint8_t *)(0x42DE2534UL))
#define bFM_GPIO_PCRA_PE                          *((volatile  uint8_t *)(0x42DE2538UL))
#define bFM4_GPIO_PCRA_PE                         *((volatile  uint8_t *)(0x42DE2538UL))
#define bFM_GPIO_PCRA_PF                          *((volatile  uint8_t *)(0x42DE253CUL))
#define bFM4_GPIO_PCRA_PF                         *((volatile  uint8_t *)(0x42DE253CUL))

#define bFM_GPIO_PCRB_P0                          *((volatile  uint8_t *)(0x42DE2580UL))
#define bFM4_GPIO_PCRB_P0                         *((volatile  uint8_t *)(0x42DE2580UL))
#define bFM_GPIO_PCRB_P1                          *((volatile  uint8_t *)(0x42DE2584UL))
#define bFM4_GPIO_PCRB_P1                         *((volatile  uint8_t *)(0x42DE2584UL))
#define bFM_GPIO_PCRB_P2                          *((volatile  uint8_t *)(0x42DE2588UL))
#define bFM4_GPIO_PCRB_P2                         *((volatile  uint8_t *)(0x42DE2588UL))
#define bFM_GPIO_PCRB_P3                          *((volatile  uint8_t *)(0x42DE258CUL))
#define bFM4_GPIO_PCRB_P3                         *((volatile  uint8_t *)(0x42DE258CUL))
#define bFM_GPIO_PCRB_P4                          *((volatile  uint8_t *)(0x42DE2590UL))
#define bFM4_GPIO_PCRB_P4                         *((volatile  uint8_t *)(0x42DE2590UL))
#define bFM_GPIO_PCRB_P5                          *((volatile  uint8_t *)(0x42DE2594UL))
#define bFM4_GPIO_PCRB_P5                         *((volatile  uint8_t *)(0x42DE2594UL))
#define bFM_GPIO_PCRB_P6                          *((volatile  uint8_t *)(0x42DE2598UL))
#define bFM4_GPIO_PCRB_P6                         *((volatile  uint8_t *)(0x42DE2598UL))
#define bFM_GPIO_PCRB_P7                          *((volatile  uint8_t *)(0x42DE259CUL))
#define bFM4_GPIO_PCRB_P7                         *((volatile  uint8_t *)(0x42DE259CUL))

#define bFM_GPIO_PCRC_P0                          *((volatile  uint8_t *)(0x42DE2600UL))
#define bFM4_GPIO_PCRC_P0                         *((volatile  uint8_t *)(0x42DE2600UL))
#define bFM_GPIO_PCRC_P1                          *((volatile  uint8_t *)(0x42DE2604UL))
#define bFM4_GPIO_PCRC_P1                         *((volatile  uint8_t *)(0x42DE2604UL))
#define bFM_GPIO_PCRC_P2                          *((volatile  uint8_t *)(0x42DE2608UL))
#define bFM4_GPIO_PCRC_P2                         *((volatile  uint8_t *)(0x42DE2608UL))
#define bFM_GPIO_PCRC_P3                          *((volatile  uint8_t *)(0x42DE260CUL))
#define bFM4_GPIO_PCRC_P3                         *((volatile  uint8_t *)(0x42DE260CUL))
#define bFM_GPIO_PCRC_P4                          *((volatile  uint8_t *)(0x42DE2610UL))
#define bFM4_GPIO_PCRC_P4                         *((volatile  uint8_t *)(0x42DE2610UL))
#define bFM_GPIO_PCRC_P5                          *((volatile  uint8_t *)(0x42DE2614UL))
#define bFM4_GPIO_PCRC_P5                         *((volatile  uint8_t *)(0x42DE2614UL))
#define bFM_GPIO_PCRC_P6                          *((volatile  uint8_t *)(0x42DE2618UL))
#define bFM4_GPIO_PCRC_P6                         *((volatile  uint8_t *)(0x42DE2618UL))
#define bFM_GPIO_PCRC_P7                          *((volatile  uint8_t *)(0x42DE261CUL))
#define bFM4_GPIO_PCRC_P7                         *((volatile  uint8_t *)(0x42DE261CUL))
#define bFM_GPIO_PCRC_P8                          *((volatile  uint8_t *)(0x42DE2620UL))
#define bFM4_GPIO_PCRC_P8                         *((volatile  uint8_t *)(0x42DE2620UL))
#define bFM_GPIO_PCRC_P9                          *((volatile  uint8_t *)(0x42DE2624UL))
#define bFM4_GPIO_PCRC_P9                         *((volatile  uint8_t *)(0x42DE2624UL))
#define bFM_GPIO_PCRC_PA                          *((volatile  uint8_t *)(0x42DE2628UL))
#define bFM4_GPIO_PCRC_PA                         *((volatile  uint8_t *)(0x42DE2628UL))
#define bFM_GPIO_PCRC_PB                          *((volatile  uint8_t *)(0x42DE262CUL))
#define bFM4_GPIO_PCRC_PB                         *((volatile  uint8_t *)(0x42DE262CUL))
#define bFM_GPIO_PCRC_PC                          *((volatile  uint8_t *)(0x42DE2630UL))
#define bFM4_GPIO_PCRC_PC                         *((volatile  uint8_t *)(0x42DE2630UL))
#define bFM_GPIO_PCRC_PD                          *((volatile  uint8_t *)(0x42DE2634UL))
#define bFM4_GPIO_PCRC_PD                         *((volatile  uint8_t *)(0x42DE2634UL))
#define bFM_GPIO_PCRC_PE                          *((volatile  uint8_t *)(0x42DE2638UL))
#define bFM4_GPIO_PCRC_PE                         *((volatile  uint8_t *)(0x42DE2638UL))
#define bFM_GPIO_PCRC_PF                          *((volatile  uint8_t *)(0x42DE263CUL))
#define bFM4_GPIO_PCRC_PF                         *((volatile  uint8_t *)(0x42DE263CUL))

#define bFM_GPIO_PCRD_P0                          *((volatile  uint8_t *)(0x42DE2680UL))
#define bFM4_GPIO_PCRD_P0                         *((volatile  uint8_t *)(0x42DE2680UL))
#define bFM_GPIO_PCRD_P1                          *((volatile  uint8_t *)(0x42DE2684UL))
#define bFM4_GPIO_PCRD_P1                         *((volatile  uint8_t *)(0x42DE2684UL))
#define bFM_GPIO_PCRD_P2                          *((volatile  uint8_t *)(0x42DE2688UL))
#define bFM4_GPIO_PCRD_P2                         *((volatile  uint8_t *)(0x42DE2688UL))

#define bFM_GPIO_PCRE_P0                          *((volatile  uint8_t *)(0x42DE2700UL))
#define bFM4_GPIO_PCRE_P0                         *((volatile  uint8_t *)(0x42DE2700UL))
#define bFM_GPIO_PCRE_P2                          *((volatile  uint8_t *)(0x42DE2708UL))
#define bFM4_GPIO_PCRE_P2                         *((volatile  uint8_t *)(0x42DE2708UL))
#define bFM_GPIO_PCRE_P3                          *((volatile  uint8_t *)(0x42DE270CUL))
#define bFM4_GPIO_PCRE_P3                         *((volatile  uint8_t *)(0x42DE270CUL))

#define bFM_GPIO_PCRF_P0                          *((volatile  uint8_t *)(0x42DE2780UL))
#define bFM4_GPIO_PCRF_P0                         *((volatile  uint8_t *)(0x42DE2780UL))
#define bFM_GPIO_PCRF_P1                          *((volatile  uint8_t *)(0x42DE2784UL))
#define bFM4_GPIO_PCRF_P1                         *((volatile  uint8_t *)(0x42DE2784UL))
#define bFM_GPIO_PCRF_P2                          *((volatile  uint8_t *)(0x42DE2788UL))
#define bFM4_GPIO_PCRF_P2                         *((volatile  uint8_t *)(0x42DE2788UL))
#define bFM_GPIO_PCRF_P3                          *((volatile  uint8_t *)(0x42DE278CUL))
#define bFM4_GPIO_PCRF_P3                         *((volatile  uint8_t *)(0x42DE278CUL))
#define bFM_GPIO_PCRF_P4                          *((volatile  uint8_t *)(0x42DE2790UL))
#define bFM4_GPIO_PCRF_P4                         *((volatile  uint8_t *)(0x42DE2790UL))
#define bFM_GPIO_PCRF_P5                          *((volatile  uint8_t *)(0x42DE2794UL))
#define bFM4_GPIO_PCRF_P5                         *((volatile  uint8_t *)(0x42DE2794UL))
#define bFM_GPIO_PCRF_P6                          *((volatile  uint8_t *)(0x42DE2798UL))
#define bFM4_GPIO_PCRF_P6                         *((volatile  uint8_t *)(0x42DE2798UL))
#define bFM_GPIO_PCRF_P7                          *((volatile  uint8_t *)(0x42DE279CUL))
#define bFM4_GPIO_PCRF_P7                         *((volatile  uint8_t *)(0x42DE279CUL))

#define bFM_GPIO_PDIR0_P0                         *((volatile  uint8_t *)(0x42DE6000UL))
#define bFM4_GPIO_PDIR0_P0                        *((volatile  uint8_t *)(0x42DE6000UL))
#define bFM_GPIO_PDIR0_P1                         *((volatile  uint8_t *)(0x42DE6004UL))
#define bFM4_GPIO_PDIR0_P1                        *((volatile  uint8_t *)(0x42DE6004UL))
#define bFM_GPIO_PDIR0_P2                         *((volatile  uint8_t *)(0x42DE6008UL))
#define bFM4_GPIO_PDIR0_P2                        *((volatile  uint8_t *)(0x42DE6008UL))
#define bFM_GPIO_PDIR0_P3                         *((volatile  uint8_t *)(0x42DE600CUL))
#define bFM4_GPIO_PDIR0_P3                        *((volatile  uint8_t *)(0x42DE600CUL))
#define bFM_GPIO_PDIR0_P4                         *((volatile  uint8_t *)(0x42DE6010UL))
#define bFM4_GPIO_PDIR0_P4                        *((volatile  uint8_t *)(0x42DE6010UL))
#define bFM_GPIO_PDIR0_P8                         *((volatile  uint8_t *)(0x42DE6020UL))
#define bFM4_GPIO_PDIR0_P8                        *((volatile  uint8_t *)(0x42DE6020UL))
#define bFM_GPIO_PDIR0_P9                         *((volatile  uint8_t *)(0x42DE6024UL))
#define bFM4_GPIO_PDIR0_P9                        *((volatile  uint8_t *)(0x42DE6024UL))
#define bFM_GPIO_PDIR0_PA                         *((volatile  uint8_t *)(0x42DE6028UL))
#define bFM4_GPIO_PDIR0_PA                        *((volatile  uint8_t *)(0x42DE6028UL))

#define bFM_GPIO_PDIR1_P0                         *((volatile  uint8_t *)(0x42DE6080UL))
#define bFM4_GPIO_PDIR1_P0                        *((volatile  uint8_t *)(0x42DE6080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile  uint8_t *)(0x42DE6084UL))
#define bFM4_GPIO_PDIR1_P1                        *((volatile  uint8_t *)(0x42DE6084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile  uint8_t *)(0x42DE6088UL))
#define bFM4_GPIO_PDIR1_P2                        *((volatile  uint8_t *)(0x42DE6088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile  uint8_t *)(0x42DE608CUL))
#define bFM4_GPIO_PDIR1_P3                        *((volatile  uint8_t *)(0x42DE608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile  uint8_t *)(0x42DE6090UL))
#define bFM4_GPIO_PDIR1_P4                        *((volatile  uint8_t *)(0x42DE6090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile  uint8_t *)(0x42DE6094UL))
#define bFM4_GPIO_PDIR1_P5                        *((volatile  uint8_t *)(0x42DE6094UL))
#define bFM_GPIO_PDIR1_P6                         *((volatile  uint8_t *)(0x42DE6098UL))
#define bFM4_GPIO_PDIR1_P6                        *((volatile  uint8_t *)(0x42DE6098UL))
#define bFM_GPIO_PDIR1_P7                         *((volatile  uint8_t *)(0x42DE609CUL))
#define bFM4_GPIO_PDIR1_P7                        *((volatile  uint8_t *)(0x42DE609CUL))
#define bFM_GPIO_PDIR1_P8                         *((volatile  uint8_t *)(0x42DE60A0UL))
#define bFM4_GPIO_PDIR1_P8                        *((volatile  uint8_t *)(0x42DE60A0UL))
#define bFM_GPIO_PDIR1_P9                         *((volatile  uint8_t *)(0x42DE60A4UL))
#define bFM4_GPIO_PDIR1_P9                        *((volatile  uint8_t *)(0x42DE60A4UL))
#define bFM_GPIO_PDIR1_PA                         *((volatile  uint8_t *)(0x42DE60A8UL))
#define bFM4_GPIO_PDIR1_PA                        *((volatile  uint8_t *)(0x42DE60A8UL))
#define bFM_GPIO_PDIR1_PB                         *((volatile  uint8_t *)(0x42DE60ACUL))
#define bFM4_GPIO_PDIR1_PB                        *((volatile  uint8_t *)(0x42DE60ACUL))
#define bFM_GPIO_PDIR1_PC                         *((volatile  uint8_t *)(0x42DE60B0UL))
#define bFM4_GPIO_PDIR1_PC                        *((volatile  uint8_t *)(0x42DE60B0UL))
#define bFM_GPIO_PDIR1_PD                         *((volatile  uint8_t *)(0x42DE60B4UL))
#define bFM4_GPIO_PDIR1_PD                        *((volatile  uint8_t *)(0x42DE60B4UL))
#define bFM_GPIO_PDIR1_PE                         *((volatile  uint8_t *)(0x42DE60B8UL))
#define bFM4_GPIO_PDIR1_PE                        *((volatile  uint8_t *)(0x42DE60B8UL))
#define bFM_GPIO_PDIR1_PF                         *((volatile  uint8_t *)(0x42DE60BCUL))
#define bFM4_GPIO_PDIR1_PF                        *((volatile  uint8_t *)(0x42DE60BCUL))

#define bFM_GPIO_PDIR2_P0                         *((volatile  uint8_t *)(0x42DE6100UL))
#define bFM4_GPIO_PDIR2_P0                        *((volatile  uint8_t *)(0x42DE6100UL))
#define bFM_GPIO_PDIR2_P1                         *((volatile  uint8_t *)(0x42DE6104UL))
#define bFM4_GPIO_PDIR2_P1                        *((volatile  uint8_t *)(0x42DE6104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile  uint8_t *)(0x42DE6108UL))
#define bFM4_GPIO_PDIR2_P2                        *((volatile  uint8_t *)(0x42DE6108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile  uint8_t *)(0x42DE610CUL))
#define bFM4_GPIO_PDIR2_P3                        *((volatile  uint8_t *)(0x42DE610CUL))
#define bFM_GPIO_PDIR2_P4                         *((volatile  uint8_t *)(0x42DE6110UL))
#define bFM4_GPIO_PDIR2_P4                        *((volatile  uint8_t *)(0x42DE6110UL))
#define bFM_GPIO_PDIR2_P5                         *((volatile  uint8_t *)(0x42DE6114UL))
#define bFM4_GPIO_PDIR2_P5                        *((volatile  uint8_t *)(0x42DE6114UL))
#define bFM_GPIO_PDIR2_P6                         *((volatile  uint8_t *)(0x42DE6118UL))
#define bFM4_GPIO_PDIR2_P6                        *((volatile  uint8_t *)(0x42DE6118UL))
#define bFM_GPIO_PDIR2_P7                         *((volatile  uint8_t *)(0x42DE611CUL))
#define bFM4_GPIO_PDIR2_P7                        *((volatile  uint8_t *)(0x42DE611CUL))
#define bFM_GPIO_PDIR2_P8                         *((volatile  uint8_t *)(0x42DE6120UL))
#define bFM4_GPIO_PDIR2_P8                        *((volatile  uint8_t *)(0x42DE6120UL))
#define bFM_GPIO_PDIR2_P9                         *((volatile  uint8_t *)(0x42DE6124UL))
#define bFM4_GPIO_PDIR2_P9                        *((volatile  uint8_t *)(0x42DE6124UL))
#define bFM_GPIO_PDIR2_PA                         *((volatile  uint8_t *)(0x42DE6128UL))
#define bFM4_GPIO_PDIR2_PA                        *((volatile  uint8_t *)(0x42DE6128UL))

