mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/common/s6e2c3xj.h
#define bFM_GPIO_PDSRE_P0                         *((volatile  uint8_t *)(0x42DEEF00UL))
#define bFM4_GPIO_PDSRE_P0                        *((volatile  uint8_t *)(0x42DEEF00UL))
#define bFM_GPIO_PDSRE_P2                         *((volatile  uint8_t *)(0x42DEEF08UL))
#define bFM4_GPIO_PDSRE_P2                        *((volatile  uint8_t *)(0x42DEEF08UL))
#define bFM_GPIO_PDSRE_P3                         *((volatile  uint8_t *)(0x42DEEF0CUL))
#define bFM4_GPIO_PDSRE_P3                        *((volatile  uint8_t *)(0x42DEEF0CUL))

#define bFM_GPIO_PDSRF_P0                         *((volatile  uint8_t *)(0x42DEEF80UL))
#define bFM4_GPIO_PDSRF_P0                        *((volatile  uint8_t *)(0x42DEEF80UL))
#define bFM_GPIO_PDSRF_P1                         *((volatile  uint8_t *)(0x42DEEF84UL))
#define bFM4_GPIO_PDSRF_P1                        *((volatile  uint8_t *)(0x42DEEF84UL))
#define bFM_GPIO_PDSRF_P2                         *((volatile  uint8_t *)(0x42DEEF88UL))
#define bFM4_GPIO_PDSRF_P2                        *((volatile  uint8_t *)(0x42DEEF88UL))
#define bFM_GPIO_PDSRF_P3                         *((volatile  uint8_t *)(0x42DEEF8CUL))
#define bFM4_GPIO_PDSRF_P3                        *((volatile  uint8_t *)(0x42DEEF8CUL))
#define bFM_GPIO_PDSRF_P4                         *((volatile  uint8_t *)(0x42DEEF90UL))
#define bFM4_GPIO_PDSRF_P4                        *((volatile  uint8_t *)(0x42DEEF90UL))
#define bFM_GPIO_PDSRF_P5                         *((volatile  uint8_t *)(0x42DEEF94UL))
#define bFM4_GPIO_PDSRF_P5                        *((volatile  uint8_t *)(0x42DEEF94UL))
#define bFM_GPIO_PDSRF_P6                         *((volatile  uint8_t *)(0x42DEEF98UL))
#define bFM4_GPIO_PDSRF_P6                        *((volatile  uint8_t *)(0x42DEEF98UL))
#define bFM_GPIO_PDSRF_P7                         *((volatile  uint8_t *)(0x42DEEF9CUL))
#define bFM4_GPIO_PDSRF_P7                        *((volatile  uint8_t *)(0x42DEEF9CUL))

#define bFM_GPIO_PFR0_P0                          *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P0                         *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM_GPIO_PFR0_P1                          *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P1                         *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM_GPIO_PFR0_P2                          *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P2                         *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM_GPIO_PFR0_P3                          *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P3                         *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM_GPIO_PFR0_P4                          *((volatile  uint8_t *)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P4                         *((volatile  uint8_t *)(0x42DE0010UL))
#define bFM_GPIO_PFR0_P8                          *((volatile  uint8_t *)(0x42DE0020UL))
#define bFM4_GPIO_PFR0_P8                         *((volatile  uint8_t *)(0x42DE0020UL))
#define bFM_GPIO_PFR0_P9                          *((volatile  uint8_t *)(0x42DE0024UL))
#define bFM4_GPIO_PFR0_P9                         *((volatile  uint8_t *)(0x42DE0024UL))
#define bFM_GPIO_PFR0_PA                          *((volatile  uint8_t *)(0x42DE0028UL))
#define bFM4_GPIO_PFR0_PA                         *((volatile  uint8_t *)(0x42DE0028UL))

#define bFM_GPIO_PFR1_P0                          *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P0                         *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM_GPIO_PFR1_P1                          *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P1                         *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM_GPIO_PFR1_P2                          *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P2                         *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM_GPIO_PFR1_P3                          *((volatile  uint8_t *)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P3                         *((volatile  uint8_t *)(0x42DE008CUL))
#define bFM_GPIO_PFR1_P4                          *((volatile  uint8_t *)(0x42DE0090UL))
#define bFM4_GPIO_PFR1_P4                         *((volatile  uint8_t *)(0x42DE0090UL))
#define bFM_GPIO_PFR1_P5                          *((volatile  uint8_t *)(0x42DE0094UL))
#define bFM4_GPIO_PFR1_P5                         *((volatile  uint8_t *)(0x42DE0094UL))
#define bFM_GPIO_PFR1_P6                          *((volatile  uint8_t *)(0x42DE0098UL))
#define bFM4_GPIO_PFR1_P6                         *((volatile  uint8_t *)(0x42DE0098UL))
#define bFM_GPIO_PFR1_P7                          *((volatile  uint8_t *)(0x42DE009CUL))
#define bFM4_GPIO_PFR1_P7                         *((volatile  uint8_t *)(0x42DE009CUL))
#define bFM_GPIO_PFR1_P8                          *((volatile  uint8_t *)(0x42DE00A0UL))
#define bFM4_GPIO_PFR1_P8                         *((volatile  uint8_t *)(0x42DE00A0UL))
#define bFM_GPIO_PFR1_P9                          *((volatile  uint8_t *)(0x42DE00A4UL))
#define bFM4_GPIO_PFR1_P9                         *((volatile  uint8_t *)(0x42DE00A4UL))
#define bFM_GPIO_PFR1_PA                          *((volatile  uint8_t *)(0x42DE00A8UL))
#define bFM4_GPIO_PFR1_PA                         *((volatile  uint8_t *)(0x42DE00A8UL))
#define bFM_GPIO_PFR1_PB                          *((volatile  uint8_t *)(0x42DE00ACUL))
#define bFM4_GPIO_PFR1_PB                         *((volatile  uint8_t *)(0x42DE00ACUL))
#define bFM_GPIO_PFR1_PC                          *((volatile  uint8_t *)(0x42DE00B0UL))
#define bFM4_GPIO_PFR1_PC                         *((volatile  uint8_t *)(0x42DE00B0UL))
#define bFM_GPIO_PFR1_PD                          *((volatile  uint8_t *)(0x42DE00B4UL))
#define bFM4_GPIO_PFR1_PD                         *((volatile  uint8_t *)(0x42DE00B4UL))
#define bFM_GPIO_PFR1_PE                          *((volatile  uint8_t *)(0x42DE00B8UL))
#define bFM4_GPIO_PFR1_PE                         *((volatile  uint8_t *)(0x42DE00B8UL))
#define bFM_GPIO_PFR1_PF                          *((volatile  uint8_t *)(0x42DE00BCUL))
#define bFM4_GPIO_PFR1_PF                         *((volatile  uint8_t *)(0x42DE00BCUL))

