mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/common/s6e2c3xj.h
#define bFM_MFS13_LIN_SMR_SOE                     *((volatile  uint8_t *)(0x4271A000UL))
#define bFM4_MFS13_LIN_SMR_SOE                    *((volatile  uint8_t *)(0x4271A000UL))
#define bFM_MFS13_LIN_SMR_SBL                     *((volatile  uint8_t *)(0x4271A00CUL))
#define bFM4_MFS13_LIN_SMR_SBL                    *((volatile  uint8_t *)(0x4271A00CUL))
#define bFM_MFS13_LIN_SMR_WUCR                    *((volatile  uint8_t *)(0x4271A010UL))
#define bFM4_MFS13_LIN_SMR_WUCR                   *((volatile  uint8_t *)(0x4271A010UL))

#define bFM_MFS13_LIN_SSR_TBI                     *((volatile  uint8_t *)(0x4271A0A0UL))
#define bFM4_MFS13_LIN_SSR_TBI                    *((volatile  uint8_t *)(0x4271A0A0UL))
#define bFM_MFS13_LIN_SSR_TDRE                    *((volatile  uint8_t *)(0x4271A0A4UL))
#define bFM4_MFS13_LIN_SSR_TDRE                   *((volatile  uint8_t *)(0x4271A0A4UL))
#define bFM_MFS13_LIN_SSR_RDRF                    *((volatile  uint8_t *)(0x4271A0A8UL))
#define bFM4_MFS13_LIN_SSR_RDRF                   *((volatile  uint8_t *)(0x4271A0A8UL))
#define bFM_MFS13_LIN_SSR_ORE                     *((volatile  uint8_t *)(0x4271A0ACUL))
#define bFM4_MFS13_LIN_SSR_ORE                    *((volatile  uint8_t *)(0x4271A0ACUL))
#define bFM_MFS13_LIN_SSR_FRE                     *((volatile  uint8_t *)(0x4271A0B0UL))
#define bFM4_MFS13_LIN_SSR_FRE                    *((volatile  uint8_t *)(0x4271A0B0UL))
#define bFM_MFS13_LIN_SSR_LBD                     *((volatile  uint8_t *)(0x4271A0B4UL))
#define bFM4_MFS13_LIN_SSR_LBD                    *((volatile  uint8_t *)(0x4271A0B4UL))
#define bFM_MFS13_LIN_SSR_REC                     *((volatile  uint8_t *)(0x4271A0BCUL))
#define bFM4_MFS13_LIN_SSR_REC                    *((volatile  uint8_t *)(0x4271A0BCUL))

#define bFM_MFS13_UART_BGR_EXT                    *((volatile  uint8_t *)(0x4271A1BCUL))
#define bFM4_MFS13_UART_BGR_EXT                   *((volatile  uint8_t *)(0x4271A1BCUL))

#define bFM_MFS13_UART_ESCR_P                     *((volatile  uint8_t *)(0x4271A08CUL))
#define bFM4_MFS13_UART_ESCR_P                    *((volatile  uint8_t *)(0x4271A08CUL))
#define bFM_MFS13_UART_ESCR_PEN                   *((volatile  uint8_t *)(0x4271A090UL))
#define bFM4_MFS13_UART_ESCR_PEN                  *((volatile  uint8_t *)(0x4271A090UL))
#define bFM_MFS13_UART_ESCR_INV                   *((volatile  uint8_t *)(0x4271A094UL))
#define bFM4_MFS13_UART_ESCR_INV                  *((volatile  uint8_t *)(0x4271A094UL))
#define bFM_MFS13_UART_ESCR_ESBL                  *((volatile  uint8_t *)(0x4271A098UL))
#define bFM4_MFS13_UART_ESCR_ESBL                 *((volatile  uint8_t *)(0x4271A098UL))
#define bFM_MFS13_UART_ESCR_FLWEN                 *((volatile  uint8_t *)(0x4271A09CUL))
#define bFM4_MFS13_UART_ESCR_FLWEN                *((volatile  uint8_t *)(0x4271A09CUL))

#define bFM_MFS13_UART_FCR_FE1                    *((volatile  uint8_t *)(0x4271A280UL))
#define bFM4_MFS13_UART_FCR_FE1                   *((volatile  uint8_t *)(0x4271A280UL))
#define bFM_MFS13_UART_FCR_FE2                    *((volatile  uint8_t *)(0x4271A284UL))
#define bFM4_MFS13_UART_FCR_FE2                   *((volatile  uint8_t *)(0x4271A284UL))
#define bFM_MFS13_UART_FCR_FCL1                   *((volatile  uint8_t *)(0x4271A288UL))
#define bFM4_MFS13_UART_FCR_FCL1                  *((volatile  uint8_t *)(0x4271A288UL))
#define bFM_MFS13_UART_FCR_FCL2                   *((volatile  uint8_t *)(0x4271A28CUL))
#define bFM4_MFS13_UART_FCR_FCL2                  *((volatile  uint8_t *)(0x4271A28CUL))
#define bFM_MFS13_UART_FCR_FSET                   *((volatile  uint8_t *)(0x4271A290UL))
#define bFM4_MFS13_UART_FCR_FSET                  *((volatile  uint8_t *)(0x4271A290UL))
#define bFM_MFS13_UART_FCR_FLD                    *((volatile  uint8_t *)(0x4271A294UL))
#define bFM4_MFS13_UART_FCR_FLD                   *((volatile  uint8_t *)(0x4271A294UL))
#define bFM_MFS13_UART_FCR_FLST                   *((volatile  uint8_t *)(0x4271A298UL))
#define bFM4_MFS13_UART_FCR_FLST                  *((volatile  uint8_t *)(0x4271A298UL))
#define bFM_MFS13_UART_FCR_FSEL                   *((volatile  uint8_t *)(0x4271A2A0UL))
#define bFM4_MFS13_UART_FCR_FSEL                  *((volatile  uint8_t *)(0x4271A2A0UL))
#define bFM_MFS13_UART_FCR_FTIE                   *((volatile  uint8_t *)(0x4271A2A4UL))
#define bFM4_MFS13_UART_FCR_FTIE                  *((volatile  uint8_t *)(0x4271A2A4UL))
#define bFM_MFS13_UART_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271A2A8UL))
#define bFM4_MFS13_UART_FCR_FDRQ                  *((volatile  uint8_t *)(0x4271A2A8UL))
#define bFM_MFS13_UART_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271A2ACUL))
#define bFM4_MFS13_UART_FCR_FRIIE                 *((volatile  uint8_t *)(0x4271A2ACUL))
#define bFM_MFS13_UART_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271A2B0UL))
#define bFM4_MFS13_UART_FCR_FLSTE                 *((volatile  uint8_t *)(0x4271A2B0UL))

#define bFM_MFS13_UART_SCR_TXE                    *((volatile  uint8_t *)(0x4271A020UL))
#define bFM4_MFS13_UART_SCR_TXE                   *((volatile  uint8_t *)(0x4271A020UL))
#define bFM_MFS13_UART_SCR_RXE                    *((volatile  uint8_t *)(0x4271A024UL))
#define bFM4_MFS13_UART_SCR_RXE                   *((volatile  uint8_t *)(0x4271A024UL))
#define bFM_MFS13_UART_SCR_TBIE                   *((volatile  uint8_t *)(0x4271A028UL))
#define bFM4_MFS13_UART_SCR_TBIE                  *((volatile  uint8_t *)(0x4271A028UL))
#define bFM_MFS13_UART_SCR_TIE                    *((volatile  uint8_t *)(0x4271A02CUL))
#define bFM4_MFS13_UART_SCR_TIE                   *((volatile  uint8_t *)(0x4271A02CUL))
#define bFM_MFS13_UART_SCR_RIE                    *((volatile  uint8_t *)(0x4271A030UL))
#define bFM4_MFS13_UART_SCR_RIE                   *((volatile  uint8_t *)(0x4271A030UL))
#define bFM_MFS13_UART_SCR_UPCL                   *((volatile  uint8_t *)(0x4271A03CUL))
#define bFM4_MFS13_UART_SCR_UPCL                  *((volatile  uint8_t *)(0x4271A03CUL))

#define bFM_MFS13_UART_SMR_SOE                    *((volatile  uint8_t *)(0x4271A000UL))
#define bFM4_MFS13_UART_SMR_SOE                   *((volatile  uint8_t *)(0x4271A000UL))
#define bFM_MFS13_UART_SMR_BDS                    *((volatile  uint8_t *)(0x4271A008UL))
#define bFM4_MFS13_UART_SMR_BDS                   *((volatile  uint8_t *)(0x4271A008UL))
#define bFM_MFS13_UART_SMR_SBL                    *((volatile  uint8_t *)(0x4271A00CUL))
#define bFM4_MFS13_UART_SMR_SBL                   *((volatile  uint8_t *)(0x4271A00CUL))

#define bFM_MFS13_UART_SSR_TBI                    *((volatile  uint8_t *)(0x4271A0A0UL))
#define bFM4_MFS13_UART_SSR_TBI                   *((volatile  uint8_t *)(0x4271A0A0UL))
#define bFM_MFS13_UART_SSR_TDRE                   *((volatile  uint8_t *)(0x4271A0A4UL))
#define bFM4_MFS13_UART_SSR_TDRE                  *((volatile  uint8_t *)(0x4271A0A4UL))
#define bFM_MFS13_UART_SSR_RDRF                   *((volatile  uint8_t *)(0x4271A0A8UL))
#define bFM4_MFS13_UART_SSR_RDRF                  *((volatile  uint8_t *)(0x4271A0A8UL))
#define bFM_MFS13_UART_SSR_ORE                    *((volatile  uint8_t *)(0x4271A0ACUL))
#define bFM4_MFS13_UART_SSR_ORE                   *((volatile  uint8_t *)(0x4271A0ACUL))
#define bFM_MFS13_UART_SSR_FRE                    *((volatile  uint8_t *)(0x4271A0B0UL))
#define bFM4_MFS13_UART_SSR_FRE                   *((volatile  uint8_t *)(0x4271A0B0UL))
#define bFM_MFS13_UART_SSR_PE                     *((volatile  uint8_t *)(0x4271A0B4UL))
#define bFM4_MFS13_UART_SSR_PE                    *((volatile  uint8_t *)(0x4271A0B4UL))
#define bFM_MFS13_UART_SSR_REC                    *((volatile  uint8_t *)(0x4271A0BCUL))
#define bFM4_MFS13_UART_SSR_REC                   *((volatile  uint8_t *)(0x4271A0BCUL))


